# minilab: Ασκήσεις εξάσκησης - Αριθμητική Python και Προεπεξεργασία δεδομένων

## Η βιβλιοθήκη ``Pandas``

In [1]:
# Import the pandas module here once
import pandas as pd

### Exercise 1: DataFrame Basics

Create a Pandas DataFrame with the following data:

```python
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 35],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

```

1. Print the first 3 rows of the DataFrame.

2. Calculate the mean age of the individuals.

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 35],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

# Create the dataframe
df = pd.DataFrame(data)

# 1. Print the first 3 rows
print(df.head(3))

# 2. Calculate the mean age
mean_age = df['Age'].mean()
print("Mean Age:", mean_age)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
Mean Age: 28.0

### Exercise 2: Data Filtering

Given the DataFrame from Exercise 1, write code to:

1. Create a new DataFrame containing only individuals older than 25.

2. Find and print the names of individuals from Chicago.

In [3]:
# 1. Filter individuals older than 25
filtered_df = df[df['Age'] > 25]

# 2. Find names of individuals from Chicago
chicago_residents = df[df['City'] == 'Chicago']['Name']
print("Residents of Chicago:", chicago_residents.values)

Residents of Chicago: ['Charlie']

### Exercise 3: Data Sorting

Given the DataFrame from Exercise 1, write code to:

1. Sort the DataFrame by age in descending order.

2. Sort the DataFrame by name in alphabetical order.

In [4]:
# 1. Sort by age in descending order
sorted_by_age = df.sort_values(by='Age', ascending=False)

# 2. Sort by name in alphabetical order
sorted_by_name = df.sort_values(by='Name')

print("Sorted by Age:\n", sorted_by_age)
print("Sorted by Name:\n", sorted_by_name)

Sorted by Age:
       Name  Age         City
3    David   35      Houston
1      Bob   30  Los Angeles
0    Alice   25     New York
2  Charlie   22      Chicago
Sorted by Name:
       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
3    David   35      Houston

### Exercise 4: Using ``loc`` for Label-Based Indexing

Given the following DataFrame df:

```python
data = {'A': [1, 2, 3, 4, 5],
        'B': [10, 20, 30, 40, 50],
        'C': ['apple', 'banana', 'cherry', 'date', 'elderberry']}

df = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five'])
```

1. Use the ``loc`` indexer to select and print the row with the label 'three'.

2. Use the ``loc`` indexer to select and print the values from columns 'A' and 'C' for the rows with labels 'two' and 'four'.

In [5]:
data = {'A': [1, 2, 3, 4, 5],
        'B': [10, 20, 30, 40, 50],
        'C': ['apple', 'banana', 'cherry', 'date', 'elderberry']}

df = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five'])
df

       A   B           C
one    1  10       apple
two    2  20      banana
three  3  30      cherry
four   4  40        date
five   5  50  elderberry

In [6]:
# 1. Using loc to select and print the row with label 'three':
selected_row = df.loc['three']

print("Row with label 'three':\n", selected_row)

Row with label 'three':
 A         3
B        30
C    cherry
Name: three, dtype: object

In [7]:
# 2. Using loc to select and print values from columns 'A' and 'C' 
#    for the rows with labels 'two' and 'four':

selected_values = df.loc[['two', 'four'], ['A', 'C']]

print("Values from columns 'A' and 'C' for rows 'two' and 'four':\n", selected_values)

Values from columns 'A' and 'C' for rows 'two' and 'four':
       A       C
two   2  banana
four  4    date

### Exercise 5: Using ``iloc`` for Integer-Based Indexing

Given the following DataFrame df:

```python
data = {'X': [11, 22, 33, 44, 55],
        'Y': [110, 220, 330, 440, 550],
        'Z': ['apple', 'banana', 'cherry', 'date', 'elderberry']}

df = pd.DataFrame(data)
```

1. Use the ``iloc`` indexer to select and print the first row.

2. Use the ``iloc`` indexer to select and print the values from columns 'X' and 'Z' for the second and fourth rows.

In [8]:
data = {'X': [11, 22, 33, 44, 55],
        'Y': [110, 220, 330, 440, 550],
        'Z': ['apple', 'banana', 'cherry', 'date', 'elderberry']}

df = pd.DataFrame(data)
df

    X    Y           Z
0  11  110       apple
1  22  220      banana
2  33  330      cherry
3  44  440        date
4  55  550  elderberry

In [9]:
# 1. Using iloc to select and print the first row:
first_row = df.iloc[0]

print("First row:\n", first_row)

First row:
 X       11
Y      110
Z    apple
Name: 0, dtype: object

In [10]:
# 2. Using iloc to select and print values from columns 'X' and 'Z' for the second and fourth rows:
selected_values = df.iloc[[1, 3], [0, 2]]

print("Values from columns 'X' and 'Z' for rows 2 and 4:\n", selected_values)

Values from columns 'X' and 'Z' for rows 2 and 4:
     X       Z
1  22  banana
3  44    date

### Exercise 6: Data Import and Export

1. Read a CSV file named "employees.csv", in the data directory, into a Pandas DataFrame.

2. Export the DataFrame from part 1 to a new CSV file named "output.csv".

In [11]:
# 1. Read CSV into DataFrame
df = pd.read_csv("../data/employees.csv")

# 2. Export DataFrame to CSV
df.to_csv("output.csv", index=False)

### Exercise 7: Missing Data Handling

Below you are given a DataFrame with missing values. 

```python
data_na = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Age': [25, 30, 22, np.nan, 29],
        'Score1': [85, 92, 78, 65, 88],
        'Score2': [90, 87, 75, 60, np.nan]}
```

Write code to:

1. Fill missing values in the "Age" column with the mean age.

2. Remove rows with missing values.

In [12]:
import numpy as np

data_na = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Age': [25, 30, 22, np.nan, 29],
        'Score1': [85, 92, 78, 65, 88],
        'Score2': [90, 87, 75, 60, np.nan]}


# Create the dataframe
df = pd.DataFrame(data_na)
df

      Name   Age  Score1  Score2
0    Alice  25.0      85    90.0
1      Bob  30.0      92    87.0
2  Charlie  22.0      78    75.0
3    David   NaN      65    60.0
4      Eve  29.0      88     NaN

In [13]:
# 1. Fill missing values in the "Age" column with the mean age
df['Age'].fillna(df['Age'].mean(), inplace=True)
df

      Name   Age  Score1  Score2
0    Alice  25.0      85    90.0
1      Bob  30.0      92    87.0
2  Charlie  22.0      78    75.0
3    David  26.5      65    60.0
4      Eve  29.0      88     NaN

In [14]:
# 2. Remove rows with missing values
df.dropna(inplace=True)
df

      Name   Age  Score1  Score2
0    Alice  25.0      85    90.0
1      Bob  30.0      92    87.0
2  Charlie  22.0      78    75.0
3    David  26.5      65    60.0

### Exercise 8: Adding New Columns

Create a dictionary that contains the data in the following table. Then, convert this dictionary into a DataFrame. Use Hubble's law ($v = H_0 D$) to calculate the distance (in Mpc) of the galaxies and add it as a new column to the DataFrame.

| Galaxy    | Velocity (km/s) |
|-----------|-----------------|
| NGC 123   | 1320            |
| NGC 2342  | 5690            |
| NGC 4442  | 8200            |

Remember that $H_0 \simeq 70$ km/s/Mpc.

In [15]:
table_data = {
    "Galaxy" : ["NGC 123", "NGC 2342", "NGC 4442"],
    "Velocity (km/s)" : [1320, 5690, 8200]
}

df = pd.DataFrame(table_data)
df

     Galaxy  Velocity (km/s)
0   NGC 123             1320
1  NGC 2342             5690
2  NGC 4442             8200

In [16]:
H0 = 70 # Hubble's constant in km/s/Mpc

df["Distance (Mpc)"] = df["Velocity (km/s)"] / H0
df

     Galaxy  Velocity (km/s)  Distance (Mpc)
0   NGC 123             1320       18.857143
1  NGC 2342             5690       81.285714
2  NGC 4442             8200      117.142857

### Exercise 9: Data Pre-processing with Pandas

Suppose you have a dataset containing information about student performance, but it requires some basic pre-processing before analysis. You are provided with a DataFrame named ``students_df`` with the following columns: 'StudentID', 'Name', 'MathScore', 'ScienceScore', 'EnglishScore', and 'TotalScore'. 

The exercise involves data pre-processing tasks to clean and prepare the data for analysis.

```python
data = {
    'StudentID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'MathScore': [85, 92, 78, 65, 88],
    'ScienceScore': [90, 87, 75, 88, 92],
    'EnglishScore': [80, 75, 88, 79, 95],
    'TotalScore': [265, 152, 541, 202, 215]
}

students_df = pd.DataFrame(data)
```

**Your task**:

1. The data in the 'TotalScore' column seems to be incorrect and needs to be recalculated as the sum of Math, Science, and English scores. Recalculate the 'TotalScore' column as the sum of MathScore, ScienceScore, and EnglishScore.

2. Identify and handle any missing values (if present) in the dataset. Print the modified DataFrame.

3. Calculate and add a new column 'AverageScore' that represents the average score of each student across subjects.

4. Find and print the student with the highest 'AverageScore'.

5. Identify and filter students who have scored 90 or above in at least one subject (Math, Science, or English).

6. Print the DataFrame containing only the students who meet the criteria in part 5.

In [17]:
# Create the dataframe
data = {
    'StudentID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'MathScore': [85, 92, 78, 65, 88],
    'ScienceScore': [90, 87, 75, 88, 92],
    'EnglishScore': [80, 75, 88, 79, 95],
    'TotalScore': [265, 152, 541, 202, 215]
}

students_df = pd.DataFrame(data)
students_df

   StudentID     Name  MathScore  ScienceScore  EnglishScore  TotalScore
0          1    Alice         85            90            80         265
1          2      Bob         92            87            75         152
2          3  Charlie         78            75            88         541
3          4    David         65            88            79         202
4          5      Eve         88            92            95         215

In [18]:
# 1. Recalculating the 'TotalScore' column
students_df['TotalScore'] = students_df['MathScore'] + students_df['ScienceScore'] + students_df['EnglishScore']
students_df

   StudentID     Name  MathScore  ScienceScore  EnglishScore  TotalScore
0          1    Alice         85            90            80         255
1          2      Bob         92            87            75         254
2          3  Charlie         78            75            88         241
3          4    David         65            88            79         232
4          5      Eve         88            92            95         275

In [19]:
# 2. Identifying and handling missing values
students_df.isna().sum()

StudentID       0
Name            0
MathScore       0
ScienceScore    0
EnglishScore    0
TotalScore      0
dtype: int64

The DataFrame does not contain any missing values, so we do not have to handle this.

In [20]:
# 3. Calculating and adding a new 'AverageScore' column
students_df['AverageScore'] = (
    students_df['MathScore'] + 
    students_df['ScienceScore'] + 
    students_df['EnglishScore']
) / 3

students_df

,StudentID,Name,MathScore,ScienceScore,EnglishScore,TotalScore,AverageScore
0,1,Alice,85,90,80,255,85.000000
1,2,Bob,92,87,75,254,84.666667
2,3,Charlie,78,75,88,241,80.333333
3,4,David,65,88,79,232,77.333333
4,5,Eve,88,92,95,275,91.666667

In [21]:
# 4. Finding the student with the highest 'AverageScore'
highest_avg_score_mask = students_df['AverageScore'] == students_df['AverageScore'].max()

highest_avg_score_student = students_df[highest_avg_score_mask]['Name'].values[0]

print("Student with the highest AverageScore:", highest_avg_score_student)

Student with the highest AverageScore: Eve

In [22]:
# 5. Identifying and filtering students who have scored 90 or above in at least one subject
above_90_score_mask = (
    (students_df['MathScore'] >= 90) | 
    (students_df['ScienceScore'] >= 90) | 
    (students_df['EnglishScore'] >= 90)
)

filtered_students = students_df[above_90_score_mask]

In [23]:
# 6. Printing the filtered DataFrame
print("Students who have scored 90 or above in at least one subject:")
filtered_students

Students who have scored 90 or above in at least one subject:

,StudentID,Name,MathScore,ScienceScore,EnglishScore,TotalScore,AverageScore
0,1,Alice,85,90,80,255,85.000000
1,2,Bob,92,87,75,254,84.666667
4,5,Eve,88,92,95,275,91.666667